NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_access.c
/* Copyright (c) 2010 - 2019, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <unity.h>
#include <cmock.h>
#include <string.h>

#include "utils.h"
#include "test_assert.h"

#include "log.h"
#include "fifo.h"

#include "access.h"
#include "access_internal.h"
#include "access_config.h"
#include "access_status.h"
#include "access_utils.h"

#include "access_publish_mock.h"
#include "access_reliable_mock.h"
#include "access_publish_retransmission_mock.h"

#include "device_state_manager_mock.h"
#include "flash_manager_mock.h"
#include "nrf_mesh_events_mock.h"
#include "nrf_mesh_mock.h"
#include "nrf_mesh_utils_mock.h"
#include "event_mock.h"
#include "bearer_event_mock.h"
#include "proxy_mock.h"
#include "manual_mock_queue.h"
#include "mesh_mem_mock.h"
#include "nrf_mesh_externs_mock.h"

#define TEST_REFERENCE ((void*) 0xB00BB00B)
#define TEST_MODEL_ID (0xB00B)

#define SOURCE_ADDRESS (0x0001)
#define ELEMENT_ADDRESS_START (0x0011)
#define GROUP_ADDRESS_START   (0xC001)
#define PUBLISH_ADDRESS_START (0x0101)
#define OPCODE_COUNT (5)
#define ACCESS_LOOPBACK_FLAG  (0x11223344ul)

#define MSG_EVT_MAX_COUNT (ACCESS_ELEMENT_COUNT)
#define TX_EVT_MAX_COUNT (ACCESS_ELEMENT_COUNT)

#define ALLOC_BUFFER_SIZE (380)

#define FLASH_TEST_VECTOR_INSTANCE(MODEL_ID, ELEMENT_INDEX, P_SUB_ADDRS, NO_SUB_ADDRS, SUB_SHARE_IDX,\
                                   PUB_HANDLE, PUB_PERIOD, P_APPKEYS, NO_APPKEYS, PUB_APPKEY, TTL, CRED) \
    {\
        .add_params = {\
                        .model_id = (MODEL_ID),\
                        .element_index = (ELEMENT_INDEX),\
                        .p_opcode_handlers =  &m_opcode_handlers[0][0],\
                        .opcode_count = (OPCODE_COUNT),\
                        .p_args = NULL,\
                        .publish_timeout_cb = publish_timeout_cb\
                      },\
        .p_subsciption_address_handles = (P_SUB_ADDRS),\
        .number_of_subscription_handles = (NO_SUB_ADDRS),\
        .subscription_list_share_index = (SUB_SHARE_IDX),\
        .publish_address_handle = (PUB_HANDLE),\
        .publish_period = (PUB_PERIOD),\
        .p_appkey_handles = (P_APPKEYS),\
        .number_of_appkey_handles = (NO_APPKEYS),\
        .publish_appkey_handle = (PUB_APPKEY),\
        .publish_ttl = (TTL), \
        .credential_flag = (CRED) \
    }

#define EXPECT(name, times) \
    do { \
        for (size_t i = 0; i < times; i++) \
        { \
            uint32_t value = 0; \
            name##_Expect(&value); \
        } \
    } while(0)

/*******************************************************************************
 * Sample data from the Mesh Profile Specification v1.0
 *******************************************************************************/

/* Message #21 (the Mesh Profile Specification v1.0, page 309) */
#define MSG_21_VENDOR_MODEL_OPCODE      (0x15 | 0xC0)
#define MSG_21_VENDOR_MODEL_COMPANY_ID  (0x000a)
#define MSG_21_ACCESS_PARAMS_RAW        {0x48, 0x65, 0x6c, 0x6c, 0x6f}
#define MSG_21_ACCESS_PAYLOAD_RAW       {0xd5, 0x0a, 0x00, 0x48, 0x65, 0x6c, 0x6c, 0x6f}

/*******************************************************************************
 * Structure definitions used for testing
 *******************************************************************************/

/* Struct used for the alloc and add calls, which always take place on bootup even before restoring */
typedef struct
{
    access_model_add_params_t add_params;
    dsm_handle_t * p_subsciption_address_handles;
    uint32_t number_of_subscription_handles;
    uint32_t subscription_list_share_index;
    dsm_handle_t publish_address_handle;
    access_publish_period_t publish_period;
    dsm_handle_t * p_appkey_handles;
    uint32_t number_of_appkey_handles;
    dsm_handle_t publish_appkey_handle;
    uint8_t publish_ttl;
    bool credential_flag;
} access_flash_test_struct_t;

typedef struct
{
    access_opcode_t opcode;
    uint32_t test_reference;    /* Should be unique for the (element, model) tuple. */
    const uint8_t * p_data;
    uint32_t  length;
} msg_evt_t;

typedef struct
{
    const uint8_t * p_data;
    uint32_t length;
    uint16_t src;
    uint16_t dst;
    uint8_t ttl;
} tx_evt_t;

typedef struct
{
    fm_handle_filter_t filter;
    fm_entry_t ** pp_expected_entries;
    uint32_t entry_count;
} flash_manager_entries_read_expect_t;
MOCK_QUEUE_DEF(flash_manager_entries_read_mock, flash_manager_entries_read_expect_t, NULL);

