NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_access.c
static uint32_t flash_manager_entries_read_mock_cb(const flash_manager_t * p_manager,
                                                   const fm_handle_filter_t * p_filter,
                                                   flash_manager_read_cb_t read_cb,
                                                   void * p_args,
                                                   int calls)
{
    flash_manager_entries_read_expect_t expect;
    flash_manager_entries_read_mock_Consume(&expect);

    TEST_ASSERT_EQUAL(expect.filter.mask, p_filter->mask);
    TEST_ASSERT_EQUAL(expect.filter.match, p_filter->match);
    for (uint32_t i = 0; i < expect.entry_count; ++i)
    {
        TEST_ASSERT_EQUAL(FM_ITERATE_ACTION_CONTINUE,
                          read_cb(expect.pp_expected_entries[i], p_args));
    }
    return expect.entry_count;
}

static void restore_flash(fm_handle_filter_t * p_filter, fm_entry_t ** pp_expected_entries, uint32_t entry_count)
{
    flash_manager_entries_read_StubWithCallback(flash_manager_entries_read_mock_cb);
    flash_manager_entries_read_expect_t expect = {
        .filter = *p_filter,
        .pp_expected_entries = pp_expected_entries,
        .entry_count = entry_count,
    };
    flash_manager_entries_read_mock_Expect(&expect);
}

static void evt_handler_add_stub(nrf_mesh_evt_handler_t * p_evt_handler, int num_calls)
{
    mp_evt_handler = p_evt_handler;
}

static const void * dsm_flash_area_get_stub(int num_calls)
{
    /* Return large dsm flash area size, so as not to overflow into access area for unit testing. */
    return (const void *) (PAGE_SIZE * 10);
}

static void flash_manager_mem_listener_register_stub(fm_mem_listener_t * p_listener, int num_calls)
{
    m_listener_register_calls++;
    mp_mem_listener = p_listener;
}

static uint32_t flash_manager_add_stub(flash_manager_t * p_manager, const flash_manager_config_t * p_config, int num_calls)
{
    m_flash_manager_calls++;
    mp_flash_manager = p_manager;
    memcpy(&m_flash_manager_config, p_config, sizeof(flash_manager_config_t));
    return NRF_SUCCESS;

}

static uint32_t packet_tx_stub(const nrf_mesh_tx_params_t * p_tx_params, uint32_t * const p_ref, int num_calls)
{
    tx_evt_t tx_evt;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, fifo_pop(&m_tx_fifo, &tx_evt));
    TEST_ASSERT_EQUAL(tx_evt.length, p_tx_params->data_len);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(tx_evt.p_data, p_tx_params->p_data, tx_evt.length);
    TEST_ASSERT_EQUAL_HEX16(tx_evt.src, p_tx_params->src);
    TEST_ASSERT_EQUAL_HEX16(tx_evt.dst, p_tx_params->dst.value);
    TEST_ASSERT_EQUAL_HEX16(tx_evt.ttl, p_tx_params->ttl);
    nrf_mesh_packet_send_StubWithCallback(NULL);
    return NRF_SUCCESS;
}

static uint32_t address_get_stub(dsm_handle_t handle, nrf_mesh_address_t * p_address, int num_calls)
{
    if (handle < ACCESS_ELEMENT_COUNT + ACCESS_MODEL_COUNT + SUBSCRIPTION_ADDRESS_COUNT)
    {
        p_address->type = m_addresses[handle].type;
        p_address->value = m_addresses[handle].value;
        p_address->p_virtual_uuid = m_addresses[handle].p_virtual_uuid;
        return NRF_SUCCESS;
    }
    else
    {
        return NRF_ERROR_NOT_FOUND;
    }
}

static void retransmission_Expect(access_model_handle_t model_handle)
{
    access_publish_retransmit_t expected_publish_retransmit;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_retransmit_get(model_handle,
                                                                       &expected_publish_retransmit));
    access_publish_retransmission_message_add_mock_Expect(&expected_publish_retransmit);
}

static void access_publish_retransmission_message_add_stub(access_model_handle_t model_handle,
                                                           const access_publish_retransmit_t *p_publish_retransmit,
                                                           const access_message_tx_t *p_tx_message,
                                                           const uint8_t *p_access_payload,
                                                           uint16_t access_payload_length,
                                                           int num_calls)
{
    UNUSED_VARIABLE(model_handle);
    UNUSED_VARIABLE(p_tx_message);
    UNUSED_VARIABLE(access_payload_length);
    UNUSED_VARIABLE(num_calls);

    access_publish_retransmit_t expected_publish_retransmit;
    access_publish_retransmission_message_add_mock_Consume(&expected_publish_retransmit);

    TEST_ASSERT_EQUAL_MEMORY(&expected_publish_retransmit,
                             p_publish_retransmit,
                             sizeof(access_publish_retransmit_t));

    TEST_ASSERT(NULL != p_access_payload);

    mesh_mem_free((uint8_t*) p_access_payload);
}

void * mesh_mem_alloc_mock(size_t size, int num_calls)
{
    UNUSED_VARIABLE(num_calls);

    void* p_buffer = malloc(size);

    uintptr_t expected_value = (uintptr_t) p_buffer;
    mesh_mem_free_mock_Expect(&expected_value);

    return p_buffer;
}

void mesh_mem_free_mock(void * ptr, int num_calls)
{
    UNUSED_VARIABLE(num_calls);

    /* No way to check pointer here because of reordering malloc/free in
     * the code */
    uintptr_t expected_value;
    mesh_mem_free_mock_Consume(&expected_value);

    free(ptr);
}

static void publish_timeout_cb(access_model_handle_t handle, void * p_args)
{
}

static inline void expect_msg(access_opcode_t opcode, uint32_t ref, const uint8_t * p_data, uint32_t length)
{
    msg_evt_t msg_evt;
    msg_evt.opcode = opcode;
    msg_evt.test_reference = ref;
    msg_evt.p_data = p_data;
    msg_evt.length = length;

    TEST_ASSERT_EQUAL_MESSAGE(NRF_SUCCESS, fifo_push(&m_msg_fifo, &msg_evt),
                              "Unable to push to expect_msg FIFO.");
}

static uint8_t expected_tx_ttl_get(access_model_handle_t handle)
{
    uint8_t model_ttl;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_ttl_get(handle, &model_ttl));

    if (model_ttl == ACCESS_TTL_USE_DEFAULT)
    {
        return (access_default_ttl_get());
    }

