NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_access.c
    return model_ttl;
}

static uint8_t expected_response_ttl_get(access_model_handle_t handle, uint8_t rx_ttl)
{
    uint8_t model_ttl;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_ttl_get(handle, &model_ttl));

    if (rx_ttl == 0)
    {
        return 0;
    }

    return expected_tx_ttl_get(handle);
}

static inline void expect_tx(const uint8_t * p_data, uint32_t length, uint16_t src, uint16_t dst,
                             uint8_t ttl, dsm_handle_t appkey_handle, dsm_handle_t subnet_handle,
                             tx_secmat_type_t tx_secmat_type)
{
    tx_evt_t tx_evt;
    tx_evt.p_data = p_data;
    tx_evt.length = length;
    tx_evt.src = src;
    tx_evt.dst = dst;
    tx_evt.ttl = ttl;

#if MESH_FEATURE_GATT_PROXY_ENABLED
    proxy_is_enabled_ExpectAndReturn(true);
#endif
    nrf_mesh_packet_send_StubWithCallback(packet_tx_stub);
    dsm_address_get_StubWithCallback(address_get_stub);

    switch (tx_secmat_type)
    {
        case TX_SECMAT_TYPE_FRIENDSHIP:
            dsm_tx_friendship_secmat_get_ExpectAndReturn(subnet_handle, appkey_handle, NULL,
                                                         m_dsm_tx_friendship_secmat_get_retval);
            dsm_tx_friendship_secmat_get_IgnoreArg_p_secmat();

            if (NRF_ERROR_NOT_FOUND != m_dsm_tx_friendship_secmat_get_retval)
            {
                break;
            }
            /* fall through */
        case TX_SECMAT_TYPE_MASTER:
            dsm_tx_secmat_get_ExpectAndReturn(subnet_handle, appkey_handle, NULL, NRF_SUCCESS);
            dsm_tx_secmat_get_IgnoreArg_p_secmat();
            break;
    }

    dsm_local_unicast_addresses_get_Expect(NULL);
    dsm_local_unicast_addresses_get_IgnoreArg_p_address();
    dsm_local_unicast_addresses_get_ReturnThruPtr_p_address(&local_addresses);

    TEST_ASSERT_EQUAL_MESSAGE(NRF_SUCCESS, fifo_push(&m_tx_fifo, &tx_evt), "Unable to push to expect_tx FIFO.");
}

static uint32_t opcode_raw_write(access_opcode_t opcode, uint8_t * p_buffer)
{

    if (opcode.company_id != ACCESS_COMPANY_ID_NONE)
    {
        /* Make sure only 6-bit opcodes is used for vendor specific codes. */
        TEST_ASSERT_EQUAL_HEX16(0x00C0, (opcode.opcode & 0xFFC0));
        p_buffer[0] = opcode.opcode & 0x00FF;
        p_buffer[1] = opcode.company_id & 0x00FF;
        p_buffer[2] = (opcode.company_id >> 8) & 0x00FF;
        return 3;
    }
    else if ((opcode.opcode & 0xFF00) > 0)
    {
        TEST_ASSERT_EQUAL_HEX16(0x8000, (opcode.opcode & 0xC000));
        p_buffer[0] = (opcode.opcode >> 8) & 0x00FF;
        p_buffer[1] = opcode.opcode & 0x00FF;
        return 2;
    }
    else
    {
        p_buffer[0] = opcode.opcode & 0x00FF;
        return 1;
    }
}

static void send_msg(access_opcode_t opcode, const uint8_t * p_data, uint16_t length, dsm_handle_t dst, uint16_t key_index)
{
    uint8_t rx_buf[512];
    uint16_t len = opcode_raw_write(opcode, &rx_buf[0]);
    memcpy(&rx_buf[len], p_data, length);

    nrf_mesh_evt_t mesh_evt;
    nrf_mesh_rx_metadata_t metadata;
    memset(&metadata, 0, sizeof(metadata));
    memset(&mesh_evt, 0, sizeof(mesh_evt));
    mesh_evt.params.message.p_metadata = &metadata;
    mesh_evt.type = NRF_MESH_EVT_MESSAGE_RECEIVED;
    mesh_evt.params.message.p_buffer = rx_buf;
    mesh_evt.params.message.length = len + length;
    mesh_evt.params.message.src.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
    mesh_evt.params.message.src.value= SOURCE_ADDRESS;
    mesh_evt.params.message.secmat.p_net = NULL;
    mesh_evt.params.message.secmat.p_app = NULL;

    nrf_mesh_is_address_rx_ExpectAndReturn(&mesh_evt.params.message.dst, true);

    if (dst < ACCESS_ELEMENT_COUNT)
    {
        mesh_evt.params.message.dst.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
        mesh_evt.params.message.dst.value = dst + ELEMENT_ADDRESS_START;
        dsm_local_unicast_addresses_get_Expect(NULL);
        dsm_local_unicast_addresses_get_IgnoreArg_p_address();
        dsm_local_unicast_addresses_get_ReturnThruPtr_p_address(&local_addresses);
    }
    else if (dst < ACCESS_ELEMENT_COUNT + ACCESS_MODEL_COUNT + SUBSCRIPTION_ADDRESS_COUNT)
    {
        mesh_evt.params.message.dst.type = NRF_MESH_ADDRESS_TYPE_GROUP;
        mesh_evt.params.message.dst.value = dst - ACCESS_ELEMENT_COUNT + GROUP_ADDRESS_START;
        dsm_address_handle_get_ExpectAndReturn(NULL, NULL, NRF_SUCCESS);
        dsm_address_handle_get_IgnoreArg_p_address();
        dsm_address_handle_get_IgnoreArg_p_address_handle();
        dsm_address_handle_get_ReturnThruPtr_p_address_handle(&dst);
    }
    else
    {
        printf("Handle: %u\n", dst);
        TEST_FAIL_MESSAGE("Unknown handle");
    }
    dsm_appkey_handle_get_ExpectAndReturn(NULL, key_index);
    dsm_subnet_handle_get_ExpectAndReturn(NULL, key_index);

    mp_evt_handler->evt_cb(&mesh_evt);
}

static void opcode_handler(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    msg_evt_t msg_evt;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, fifo_pop(&m_msg_fifo, &msg_evt));
    TEST_ASSERT_EQUAL_HEX32(msg_evt.test_reference, (uint32_t) p_args); /*lint !e611 Cast needed to compare values. */
    TEST_ASSERT_EQUAL(msg_evt.opcode.opcode, p_message->opcode.opcode);
    TEST_ASSERT_EQUAL(msg_evt.opcode.company_id, p_message->opcode.company_id);
    TEST_ASSERT_EQUAL(msg_evt.length, p_message->length);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(msg_evt.p_data, p_message->p_data, msg_evt.length);

    /* Reply */
    access_message_tx_t reply;
    uint8_t data[] = "reply";
    reply.opcode.opcode = 0x8234;
    reply.opcode.company_id = ACCESS_COMPANY_ID_NONE;
    reply.p_buffer = data;
    reply.length = sizeof(data);
    reply.force_segmented = false;
    reply.transmic_size = NRF_MESH_TRANSMIC_SIZE_DEFAULT;
    uint8_t expected_data[sizeof(data) + sizeof(uint32_t)];
    uint16_t length = opcode_raw_write(reply.opcode, expected_data);
    memcpy(&expected_data[length], data, sizeof(data));
    length += sizeof(data);

    bool friendship_credentials_flag = false;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_friendship_credential_flag_get(handle, &friendship_credentials_flag));

    /* Expect correct ttl */
    uint8_t ttl = expected_response_ttl_get(handle, p_message->meta_data.ttl);

    /* Never loop back the response: */
    expect_tx(expected_data,
                length,
                ELEMENT_ADDRESS_START + handle * ACCESS_ELEMENT_COUNT / ACCESS_MODEL_COUNT,
                p_message->meta_data.src.value,
                ttl,
                p_message->meta_data.appkey_handle,
                p_message->meta_data.subnet_handle,
                friendship_credentials_flag ? TX_SECMAT_TYPE_FRIENDSHIP : TX_SECMAT_TYPE_MASTER);

    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_reply(handle, p_message, &reply));
}


