NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_access.c
/*******************************************************************************
 * Test Setup
 *******************************************************************************/

/** Distributes models across the number of elements. */
void build_device_setup(uint32_t elem_count, uint32_t model_count)
{
    /* Ensure there are enough models to test ttl variations */
    TEST_ASSERT_TRUE(model_count > 2);

    const uint32_t MODELS_PER_ELEMENT = (model_count + elem_count - 1)/elem_count;
    access_model_add_params_t init_params;
    init_params.model_id.model_id = TEST_MODEL_ID;
    init_params.model_id.company_id = ACCESS_COMPANY_ID_NONE;
    init_params.p_opcode_handlers = NULL;
    init_params.opcode_count = 0;
    init_params.p_args = NULL;
    init_params.publish_timeout_cb = NULL;

    for (uint32_t i = 0; i < elem_count; ++i)
    {
        uint32_t model_count__ = model_count > MODELS_PER_ELEMENT ? MODELS_PER_ELEMENT : model_count;
        model_count -= model_count__;
        for (uint32_t j = 0; j < model_count__; j++)
        {
            access_model_handle_t handle = i*MODELS_PER_ELEMENT + j;
            for (uint32_t k = 0; k < OPCODE_COUNT; ++k)
            {
                m_opcode_handlers[handle][k].opcode.opcode = (init_params.model_id.model_id-TEST_MODEL_ID)*OPCODE_COUNT + k;
                m_opcode_handlers[handle][k].opcode.company_id = ACCESS_COMPANY_ID_NONE;
                m_opcode_handlers[handle][k].handler = opcode_handler;
            }


            /* Model hasn't been allocated yet. */
            init_params.p_opcode_handlers = &m_opcode_handlers[handle][0];
            init_params.opcode_count = OPCODE_COUNT;
            init_params.p_args = ((uint32_t*)TEST_REFERENCE + handle);
            init_params.element_index = i;
            TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_add(&init_params, &handle));
            if (i > 0)
            {
                /* Try to add the model_id to a the previous element which should already have the
                 * model_id present. */
                TEST_ASSERT_EQUAL(NRF_ERROR_FORBIDDEN, access_model_add(&init_params, &handle));
            }
            uint8_t ttl = 129; //invalid dummy value
            TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_ttl_get(handle, &ttl));
            TEST_ASSERT_EQUAL(ACCESS_TTL_USE_DEFAULT, ttl);

            /* Re-adding the same model isn't allowed. */
            TEST_ASSERT_EQUAL(NRF_ERROR_FORBIDDEN, access_model_add(&init_params, &handle));
            TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_application_bind(handle, 0));
            TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_application_set(handle, 0));
            TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_address_set(handle, ACCESS_ELEMENT_COUNT + handle));

            /* Add various publish ttl values */
            if (i % 3 == 0)
            {
                TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_ttl_set(handle, 0));
            }
            else if (i % 3 == 1)
            {
                TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_ttl_set(handle, ACCESS_TTL_USE_DEFAULT));
            }
            else
            {
                TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_ttl_set(handle, i));
            }

            if (handle == (ACCESS_MODEL_COUNT - 1))
            {
                /* We compile the test with one list less than the number of models. */
                TEST_ASSERT_EQUAL(NRF_ERROR_NO_MEM, access_model_subscription_list_alloc(handle));
            }
            else
            {
                TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_alloc(handle));
            }

            access_publish_retransmit_t publish_retransmit =
            {
                .count = 1,
                .interval_steps = 1,
            };
            TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_retransmit_set(handle, publish_retransmit));

            init_params.model_id.model_id++;
        }

        /* Reset Model ID */
        init_params.model_id.model_id = TEST_MODEL_ID;
    }
}

static void setup_addresses(void)
{
    for (uint32_t i = 0; i < ACCESS_ELEMENT_COUNT; ++i)
    {
        m_addresses[i].type = NRF_MESH_ADDRESS_TYPE_UNICAST;
        m_addresses[i].value = ELEMENT_ADDRESS_START + i;
    }

    for (uint32_t i = 0; i < ACCESS_MODEL_COUNT; ++i)
    {
        m_addresses[i + ACCESS_ELEMENT_COUNT].type = NRF_MESH_ADDRESS_TYPE_UNICAST;
        m_addresses[i + ACCESS_ELEMENT_COUNT].value = PUBLISH_ADDRESS_START + i;
    }

    for (uint32_t i = 0; i < SUBSCRIPTION_ADDRESS_COUNT; ++i)
    {
        m_addresses[i + ACCESS_ELEMENT_COUNT + ACCESS_MODEL_COUNT].type = NRF_MESH_ADDRESS_TYPE_GROUP;
        m_addresses[i + ACCESS_ELEMENT_COUNT + ACCESS_MODEL_COUNT].value = GROUP_ADDRESS_START + i;
    }
}

void setUp(void)
{
    device_state_manager_mock_Init();
    flash_manager_mock_Init();
    nrf_mesh_mock_Init();
    nrf_mesh_events_mock_Init();
    nrf_mesh_utils_mock_Init();
    event_mock_Init();
    bearer_event_mock_Init();
    access_publish_mock_Init();
    access_publish_retransmission_mock_Init();
    proxy_mock_Init();
    flash_manager_entries_read_mock_Init();
    mesh_mem_mock_Init();
    access_publish_retransmission_message_add_mock_Init();
    mesh_mem_free_mock_Init();
    nrf_mesh_externs_mock_Init();

    __LOG_INIT(0xFFFFFFFF, LOG_LEVEL_REPORT, LOG_CALLBACK_DEFAULT);
    memset(&m_msg_fifo, 0, sizeof(m_msg_fifo));
    memset(m_msg_evt_buffer, 0, sizeof(m_msg_evt_buffer));
    m_msg_fifo.array_len = MSG_EVT_MAX_COUNT;
    m_msg_fifo.elem_array = &m_msg_evt_buffer[0];
    m_msg_fifo.elem_size = sizeof(msg_evt_t);

    memset(&m_tx_fifo, 0, sizeof(m_tx_fifo));
    memset(m_tx_evt_buffer, 0, sizeof(m_tx_evt_buffer));
    m_tx_fifo.array_len = TX_EVT_MAX_COUNT;
    m_tx_fifo.elem_array = &m_tx_evt_buffer[0];
    m_tx_fifo.elem_size = sizeof(tx_evt_t);
    setup_addresses();
    fifo_init(&m_msg_fifo);

    m_flash_manager_calls = 0;
    m_listener_register_calls = 0;

    mesh_mem_alloc_StubWithCallback(mesh_mem_alloc_mock);
    mesh_mem_free_StubWithCallback(mesh_mem_free_mock);

    nrf_mesh_evt_handler_add_StubWithCallback(evt_handler_add_stub);
    dsm_flash_area_get_StubWithCallback(dsm_flash_area_get_stub);
    flash_manager_mem_listener_register_StubWithCallback(flash_manager_mem_listener_register_stub);
    flash_manager_add_StubWithCallback(flash_manager_add_stub);
    access_publish_retransmission_message_add_StubWithCallback(access_publish_retransmission_message_add_stub);
    access_reliable_init_Expect();
    access_publish_init_Expect();
    access_publish_retransmission_init_Expect();
    access_init();

    m_dsm_tx_friendship_secmat_get_retval = NRF_SUCCESS;
}

void tearDown(void)
{
    TEST_ASSERT(fifo_is_empty(&m_msg_fifo));
    TEST_ASSERT(fifo_is_empty(&m_tx_fifo));
    flash_manager_mock_Verify();
    event_mock_Verify();
    bearer_event_mock_Verify();
    access_publish_mock_Verify();
    device_state_manager_mock_Verify();
    access_reliable_mock_Verify();
    device_state_manager_mock_Verify();
    device_state_manager_mock_Destroy();
    flash_manager_mock_Verify();
    flash_manager_mock_Destroy();
    nrf_mesh_mock_Verify();
    nrf_mesh_mock_Destroy();
    nrf_mesh_events_mock_Verify();
    nrf_mesh_events_mock_Destroy();
    nrf_mesh_utils_mock_Verify();
    nrf_mesh_utils_mock_Destroy();
    event_mock_Verify();
    event_mock_Destroy();
    bearer_event_mock_Verify();
    bearer_event_mock_Destroy();
    access_publish_mock_Verify();
    access_publish_mock_Destroy();
    proxy_mock_Verify();
    proxy_mock_Destroy();
    flash_manager_entries_read_mock_Verify();
    flash_manager_entries_read_mock_Destroy();
    mesh_mem_mock_Verify();
    mesh_mem_mock_Destroy();
    access_publish_retransmission_message_add_mock_Verify();
    access_publish_retransmission_message_add_mock_Destroy();
    mesh_mem_free_mock_Verify();
    mesh_mem_free_mock_Destroy();
    nrf_mesh_externs_mock_Verify();
    nrf_mesh_externs_mock_Destroy();
}


/*****************************************************************************
 * Tests
 *****************************************************************************/

void test_model_add(void)
{
    access_model_handle_t handle;
    access_model_add_params_t init_params;
    init_params.element_index = 0;
    init_params.model_id.model_id = TEST_MODEL_ID;
    init_params.model_id.company_id = ACCESS_COMPANY_ID_NONE;
    init_params.p_opcode_handlers = &m_opcode_handlers[0][0];
    init_params.opcode_count = 0;
    init_params.p_args = TEST_REFERENCE;
    init_params.publish_timeout_cb = NULL;
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_model_add(&init_params, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_model_add(NULL, &handle));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_LENGTH, access_model_add(&init_params, &handle));
    init_params.opcode_count = OPCODE_COUNT;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, access_model_add(&init_params, &handle));

    build_device_setup(ACCESS_ELEMENT_COUNT, ACCESS_MODEL_COUNT-2);
    printf("Elements: %u, Models: %u\n", ACCESS_ELEMENT_COUNT, ACCESS_MODEL_COUNT-2);
    print_configuration();

    init_params.model_id.model_id = TEST_MODEL_ID + ACCESS_MODEL_COUNT/ACCESS_ELEMENT_COUNT - 1;
    init_params.p_opcode_handlers = &m_opcode_handlers[ACCESS_MODEL_COUNT-1][0];

    for (uint32_t i = 0; i < OPCODE_COUNT; ++i)
    {
        m_opcode_handlers[ACCESS_MODEL_COUNT-1][i].opcode.opcode = i + ACCESS_MODEL_COUNT;
        m_opcode_handlers[ACCESS_MODEL_COUNT-1][i].opcode.company_id = ACCESS_COMPANY_ID_NONE;
    }
    m_opcode_handlers[ACCESS_MODEL_COUNT-1][0].opcode.opcode = 0x07F;

    /* Expect an error since the opcode is invalid. */
    init_params.model_id.model_id++;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, access_model_add(&init_params, &handle));

    /* Make it valid => Success :) */
    m_opcode_handlers[ACCESS_MODEL_COUNT-1][0].opcode.company_id = 0xF00D;
    m_opcode_handlers[ACCESS_MODEL_COUNT-1][0].opcode.opcode = 0x0CE;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_add(&init_params, &handle));
    TEST_ASSERT_EQUAL(ACCESS_MODEL_COUNT-2, handle);

