NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_access.c
    /* Adding two models with same ID is not allowed. */
    TEST_ASSERT_EQUAL(NRF_ERROR_FORBIDDEN, access_model_add(&init_params, &handle));
    init_params.element_index = ACCESS_ELEMENT_COUNT;
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_add(&init_params, &handle));

    /* There should be one free spot at the end now. Test, opcode count zero does not work when
     * handlers are present. */
    init_params.element_index = ACCESS_ELEMENT_COUNT - 1;
    init_params.opcode_count = 0;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_LENGTH, access_model_add(&init_params, &handle));
    init_params.opcode_count = 1;
    init_params.p_opcode_handlers = NULL;
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_model_add(&init_params, &handle));
    init_params.p_opcode_handlers =  &m_opcode_handlers[ACCESS_MODEL_COUNT-1][0];
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_add(&init_params, &handle));
    TEST_ASSERT_EQUAL(ACCESS_MODEL_COUNT-1, handle);

}

void test_access_model_element_index_get(void)
{
    access_model_handle_t handle;
    access_model_add_params_t init_params;
    uint16_t element_idx;

    for (uint32_t i = 0; i < OPCODE_COUNT; ++i)
    {
        m_opcode_handlers[0][i].opcode.opcode = i + ACCESS_MODEL_COUNT;
        m_opcode_handlers[0][i].opcode.company_id = ACCESS_COMPANY_ID_NONE;
    }

    init_params.element_index = ACCESS_ELEMENT_COUNT-1;
    init_params.model_id.model_id = TEST_MODEL_ID;
    init_params.model_id.company_id = ACCESS_COMPANY_ID_NONE;
    init_params.p_opcode_handlers = &m_opcode_handlers[0][0];
    init_params.opcode_count = OPCODE_COUNT;
    init_params.p_args = TEST_REFERENCE;
    init_params.publish_timeout_cb = NULL;

    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_add(&init_params, &handle));

    /* Test null input */
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_model_element_index_get(handle, NULL));

    /* Test invalid model handle */
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_element_index_get(handle + 1, &element_idx));

    /* Test correct behaviour */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_element_index_get(handle, &element_idx));
    TEST_ASSERT_EQUAL(init_params.element_index, element_idx);
}

void test_rx_tx(void)
{
    build_device_setup(ACCESS_ELEMENT_COUNT, ACCESS_MODEL_COUNT);

    access_opcode_t opcode = ACCESS_OPCODE_SIG(0);
    const uint8_t data[] = "Hello, World!";
    const uint16_t data_length = sizeof(data);
    const uint32_t MODELS_PER_ELEMENT = ((ACCESS_MODEL_COUNT + ACCESS_ELEMENT_COUNT - 1)/ACCESS_ELEMENT_COUNT);

    for (uint32_t i = 0; i < ACCESS_ELEMENT_COUNT; ++i)
    {
        for (uint32_t j = 0; j < MODELS_PER_ELEMENT; ++j)
        {
            for (uint32_t k = 0; k < OPCODE_COUNT; ++k)
            {
                access_model_handle_t model = i*MODELS_PER_ELEMENT + j;
                void * p_args = ((uint32_t *)TEST_REFERENCE + model);
                opcode.opcode = m_opcode_handlers[model][k].opcode.opcode;
                expect_msg(opcode, (uint32_t)p_args, data, data_length);
                /* Send on element address handle. */
                access_reliable_message_rx_cb_Expect(model, NULL, p_args);
                access_reliable_message_rx_cb_IgnoreArg_p_message();
                /* TODO: CMock tries to compare the location where p_args points to :( */
                access_reliable_message_rx_cb_IgnoreArg_p_args();

                send_msg(opcode, data, data_length, i, 0);
            }
        }
    }

    /* Test unknowns as well. */
    const access_opcode_t u_opcodes[] = { ACCESS_OPCODE_SIG(0x8234), ACCESS_OPCODE_VENDOR((0x12 | 0xc0), 0x1336) };
    for (uint32_t i = 0; i < ARRAY_SIZE(u_opcodes); ++i)
    {
        send_msg(u_opcodes[i], data, data_length, 0, 0);
    }

    /* Test subscriptions */
    opcode.opcode = m_opcode_handlers[0][0].opcode.opcode;
    /* Send on subscription handle that's not set yet. */
    send_msg(opcode, data, data_length, ACCESS_ELEMENT_COUNT + ACCESS_MODEL_COUNT, 0);

    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_subscription_add(ACCESS_MODEL_COUNT, ACCESS_ELEMENT_COUNT + ACCESS_MODEL_COUNT));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_add(0, ACCESS_ELEMENT_COUNT + ACCESS_MODEL_COUNT));

    /* Test reply with friendship secmat */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_friendship_credential_flag_set(0, true));

    void * p_args = ((uint32_t *)TEST_REFERENCE);
    opcode.opcode = m_opcode_handlers[0][0].opcode.opcode;
    expect_msg(opcode, (uint32_t)p_args, data, data_length);
    access_reliable_message_rx_cb_Expect(0, NULL, NULL);
    access_reliable_message_rx_cb_IgnoreArg_p_message();
    access_reliable_message_rx_cb_IgnoreArg_p_args();

    opcode.opcode = m_opcode_handlers[0][0].opcode.opcode;
    send_msg(opcode, data, data_length, 0, 0);

    /* Test reply with friendship secmat
     *
     * The Mesh Profile Specification v1.0, Section 4.2.2.4:
     *
     * When Publish Friendship Credential Flag is set to 1 and the friendship security material is
     * not available, the master security material shall be used. */
    m_dsm_tx_friendship_secmat_get_retval = NRF_ERROR_NOT_FOUND;
    expect_msg(opcode, (uint32_t)p_args, data, data_length);

    access_reliable_message_rx_cb_Expect(0, NULL, NULL);
    access_reliable_message_rx_cb_IgnoreArg_p_message();
    access_reliable_message_rx_cb_IgnoreArg_p_args();

    send_msg(opcode, data, data_length, 0, 0);
}

void test_key_access(void)
{
    build_device_setup(ACCESS_ELEMENT_COUNT, ACCESS_MODEL_COUNT);

    access_opcode_t opcode = ACCESS_OPCODE_SIG(0);
    uint8_t data[] = "Hello, World!";
    uint16_t data_length = sizeof(data);

    /* Sanity check that we can receive a message for key index 0. */
    expect_msg(opcode, (uint32_t) TEST_REFERENCE, data, data_length);
    access_reliable_message_rx_cb_Expect(0, NULL, TEST_REFERENCE);
    access_reliable_message_rx_cb_IgnoreArg_p_message();
    /* TODO: CMock tries to compare the location where p_args points to :( */
    access_reliable_message_rx_cb_IgnoreArg_p_args();
    send_msg(opcode, data, data_length, 0, 0);

    /* Check that we don't receive a message that we don't have the application key for. */
    for (unsigned i = 1; i < DSM_APP_MAX; ++i)
    {
        send_msg(opcode, data, data_length, 0, i);
    }
}

void test_group_addressing(void)
{
    build_device_setup(ACCESS_ELEMENT_COUNT, ACCESS_MODEL_COUNT);
    /* Let the two last models share their lists. */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_lists_share(ACCESS_MODEL_COUNT-2, ACCESS_MODEL_COUNT-1));

    access_opcode_t opcode = ACCESS_OPCODE_SIG(0);
    uint8_t data[] = "Hello, World!";
    uint16_t data_length = sizeof(data);

    /* Add the same subscription for every model instance. */
    const uint32_t MODELS_PER_ELEMENT = ((ACCESS_MODEL_COUNT + ACCESS_ELEMENT_COUNT - 1)/ACCESS_ELEMENT_COUNT);
    for (uint32_t i = 0; i < ACCESS_ELEMENT_COUNT; ++i)
    {
        for (uint32_t j = 0; j < MODELS_PER_ELEMENT; ++j)
        {
            access_model_handle_t handle = i*MODELS_PER_ELEMENT + j;
            TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_add(handle, ACCESS_ELEMENT_COUNT + j));
        }
    }

    for (uint32_t i = 0; i < MODELS_PER_ELEMENT; ++i)
    {
        opcode.opcode = i*OPCODE_COUNT;
        for (uint32_t j = 0; j < ACCESS_ELEMENT_COUNT; j++)
        {
            /* Expect one message for each of the elements. */
            expect_msg(opcode, (uint32_t) ((uint32_t *)TEST_REFERENCE + j*MODELS_PER_ELEMENT + i), data, data_length);
        }
        send_msg(opcode, data, data_length, ACCESS_ELEMENT_COUNT + i, 0);
    }
}

