NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_access.c
typedef uint32_t (publication_cb)(access_model_handle_t handle,
                                    access_message_tx_t *p_tx_message);

static void publication_tests(publication_cb *p_pub_func, bool with_retransmission)
{
    access_message_tx_t message;
    const uint8_t data[] = "Hello, World";
    const access_opcode_t opcodes[] = { ACCESS_OPCODE_SIG(0x0040), ACCESS_OPCODE_SIG(0x8123), ACCESS_OPCODE_VENDOR(0x0c0, 0x1337) };
    const unsigned num_opcodes = ARRAY_SIZE(opcodes);
    message.opcode.opcode = opcodes[0].opcode;
    message.opcode.company_id =opcodes[0].company_id;
    message.p_buffer = data;
    message.length = sizeof(data);
    message.force_segmented = false;
    message.transmic_size = NRF_MESH_TRANSMIC_SIZE_DEFAULT;

    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, p_pub_func(ACCESS_MODEL_COUNT, &message));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, p_pub_func(0, &message));
    build_device_setup(ACCESS_ELEMENT_COUNT, ACCESS_MODEL_COUNT);

    message.opcode.opcode = 0x7f;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, p_pub_func(0, &message));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, p_pub_func(0, &message));

    for (uint32_t i = 0; i < ACCESS_MODEL_COUNT; ++i)
    {
        message.opcode.opcode = opcodes[i % num_opcodes].opcode;
        message.opcode.company_id =opcodes[i % num_opcodes].company_id;
        message.p_buffer = data;
        message.length = sizeof(data);

        uint16_t src = ELEMENT_ADDRESS_START + i * ACCESS_ELEMENT_COUNT / ACCESS_MODEL_COUNT;
        uint16_t dst = PUBLISH_ADDRESS_START + i;

        uint8_t expected_data[sizeof(data) + sizeof(uint32_t)];
        uint32_t length = opcode_raw_write(message.opcode, expected_data);
        memcpy(&expected_data[length], data, message.length);
        length += message.length;

        uint8_t ttl = expected_tx_ttl_get(i);
        expect_tx(expected_data, length, src, dst, ttl, 0, DSM_HANDLE_INVALID, TX_SECMAT_TYPE_MASTER);

        if (with_retransmission)
        {
            /* Check re-transmission */
            retransmission_Expect(i);
        }

        TEST_ASSERT_EQUAL(NRF_SUCCESS, p_pub_func(i, &message));
    }

    /* Test with frienship secmat */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_friendship_credential_flag_set(0, true));

    message.opcode.opcode = opcodes[0].opcode;
    message.opcode.company_id =opcodes[0].company_id;
    message.p_buffer = data;
    message.length = sizeof(data);

    uint16_t src = ELEMENT_ADDRESS_START;
    uint16_t dst = PUBLISH_ADDRESS_START;

    uint8_t expected_data[sizeof(data) + sizeof(uint32_t)];
    uint32_t length = opcode_raw_write(message.opcode, expected_data);
    memcpy(&expected_data[length], data, message.length);
    length += message.length;

    uint8_t ttl = expected_tx_ttl_get(0);
    expect_tx(expected_data, length, src, dst, ttl, 0, DSM_HANDLE_INVALID, TX_SECMAT_TYPE_FRIENDSHIP);

    if (with_retransmission)
    {
        /* Check re-transmission */
        retransmission_Expect(0);
    }

    TEST_ASSERT_EQUAL(NRF_SUCCESS, p_pub_func(0, &message));

    /* Test with frienship secmat
     *
     * The Mesh Profile Specification v1.0, Section 4.2.2.4:
     *
     * When Publish Friendship Credential Flag is set to 1 and the friendship security material is
     * not available, the master security material shall be used. */
    m_dsm_tx_friendship_secmat_get_retval = NRF_ERROR_NOT_FOUND;
    expect_tx(expected_data, length, src, dst, ttl, 0, DSM_HANDLE_INVALID, TX_SECMAT_TYPE_FRIENDSHIP);

    if (with_retransmission)
    {
        /* Check re-transmission */
        retransmission_Expect(0);
    }

    TEST_ASSERT_EQUAL(NRF_SUCCESS, p_pub_func(0, &message));
}

static uint32_t access_model_publish_publication_cb(access_model_handle_t handle,
                                                    access_message_tx_t *p_tx_message)
{
    return access_model_publish(handle, p_tx_message);
}

static uint32_t access_packet_tx_publication_cb(access_model_handle_t handle,
                                                access_message_tx_t *p_tx_message)
{
    /* Prepare access payload */
    uint16_t opcode_length = access_utils_opcode_size_get(p_tx_message->opcode);
    uint16_t payload_length = opcode_length + p_tx_message->length;
    uint8_t payload[payload_length];

    opcode_raw_write(p_tx_message->opcode, payload);
    memcpy(&payload[opcode_length], p_tx_message->p_buffer, p_tx_message->length);

    return access_packet_tx(handle, p_tx_message, payload, payload_length);
}

void test_access_model_publish(void)
{
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_model_publish(0, NULL));

    access_message_tx_t message;
    message.length = ACCESS_MESSAGE_LENGTH_MAX;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_LENGTH, access_model_publish(0, &message));

    publication_tests(access_model_publish_publication_cb, true);
}

void test_access_packet_tx(void)
{
    const uint8_t data[] = "Hello, World";
    const access_opcode_t opcode = ACCESS_OPCODE_SIG(0x0040);
    access_message_tx_t message;
    message.opcode.opcode = opcode.opcode;
    message.opcode.company_id = opcode.company_id;
    message.p_buffer = data;
    message.length = sizeof(data);
    message.force_segmented = false;
    message.transmic_size = NRF_MESH_TRANSMIC_SIZE_DEFAULT;

    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_packet_tx(0, NULL, data, sizeof(data)));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_packet_tx(0, &message, NULL, sizeof(data)));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_packet_tx(0, &message, data, 0));

    message.length = ACCESS_MESSAGE_LENGTH_MAX;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_LENGTH, access_model_publish(0, &message));

    publication_tests(access_packet_tx_publication_cb, false);
}

void test_publish_retransmit(void)
{
    access_publish_retransmit_t publish_retransmit_out = {};
    access_publish_retransmit_t publish_retransmit_in;
    publish_retransmit_in.count = 0;
    publish_retransmit_in.interval_steps = 1;

    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_retransmit_set(0, publish_retransmit_in));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_model_publish_retransmit_get(0, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_retransmit_get(0, &publish_retransmit_out));

    build_device_setup(ACCESS_ELEMENT_COUNT, ACCESS_MODEL_COUNT);

    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_retransmit_set(ACCESS_HANDLE_INVALID, publish_retransmit_in));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_retransmit_get(ACCESS_HANDLE_INVALID, &publish_retransmit_out));

