NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_access.c
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_retransmit_set(0, publish_retransmit_in));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_retransmit_get(0, &publish_retransmit_out));

    TEST_ASSERT_EQUAL_MEMORY(&publish_retransmit_in,
                             &publish_retransmit_out,
                             sizeof(access_publish_retransmit_t));

    /* Test retransmission called */
    const uint8_t data[] = "Hello, World";
    const access_opcode_t opcode = ACCESS_OPCODE_SIG(0x0040);
    access_message_tx_t message;
    message.opcode.opcode = opcode.opcode;
    message.opcode.company_id = opcode.company_id;
    message.p_buffer = data;
    message.length = sizeof(data);
    message.force_segmented = false;
    message.transmic_size = NRF_MESH_TRANSMIC_SIZE_DEFAULT;

    publish_retransmit_in.count = 2;

    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_retransmit_set(0, publish_retransmit_in));
    retransmission_Expect(0);

    uint16_t src = ELEMENT_ADDRESS_START;
    uint16_t dst = PUBLISH_ADDRESS_START;

    uint8_t expected_data[sizeof(data) + sizeof(uint32_t)];
    uint32_t length = opcode_raw_write(message.opcode, expected_data);
    memcpy(&expected_data[length], data, message.length);
    length += message.length;

    uint8_t ttl = expected_tx_ttl_get(0);
    expect_tx(expected_data, length, src, dst, ttl, 0, DSM_HANDLE_INVALID, TX_SECMAT_TYPE_MASTER);

    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish(0, &message));

    /* No retransmit, free shall be called */
    publish_retransmit_in.count = 0;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_retransmit_set(0, publish_retransmit_in));

    expect_tx(expected_data, length, src, dst, ttl, 0, DSM_HANDLE_INVALID, TX_SECMAT_TYPE_MASTER);

    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish(0, &message));
}

void test_against_spec_messages(void)
{
    access_opcode_handler_t opcode_handlers[] =
    {
        {ACCESS_OPCODE_VENDOR(MSG_21_VENDOR_MODEL_OPCODE, MSG_21_VENDOR_MODEL_COMPANY_ID), opcode_handler},
    };

    access_model_handle_t model_handle;
    access_model_add_params_t init_params;
    init_params.model_id.model_id = TEST_MODEL_ID;
    init_params.model_id.company_id = MSG_21_VENDOR_MODEL_COMPANY_ID;
    init_params.p_opcode_handlers = NULL;
    init_params.opcode_count = 0;
    init_params.p_args = NULL;
    init_params.publish_timeout_cb = NULL;
    init_params.p_opcode_handlers = &opcode_handlers[0];
    init_params.opcode_count = sizeof(opcode_handlers) / sizeof(opcode_handlers[0]);
    init_params.p_args = 0;
    init_params.element_index = 0;

    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_add(&init_params, &model_handle));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_application_bind(model_handle, 0));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_application_set(model_handle, 0));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_address_set(model_handle, ACCESS_ELEMENT_COUNT + model_handle));

    uint8_t access_params[] = MSG_21_ACCESS_PARAMS_RAW;
    uint8_t access_payload[] = MSG_21_ACCESS_PAYLOAD_RAW;

    /* Test tx */
    {

        access_message_tx_t message;
        message.opcode.opcode = MSG_21_VENDOR_MODEL_OPCODE;
        message.opcode.company_id = MSG_21_VENDOR_MODEL_COMPANY_ID;
        message.p_buffer = access_params;
        message.length = sizeof(access_params);
        message.force_segmented = false;
        message.transmic_size = NRF_MESH_TRANSMIC_SIZE_DEFAULT;

        uint16_t src = ELEMENT_ADDRESS_START;
        uint16_t dst = PUBLISH_ADDRESS_START;

        uint8_t ttl = expected_tx_ttl_get(0);
        expect_tx(access_payload, sizeof(access_payload), src, dst, ttl, 0, DSM_HANDLE_INVALID, false);

        TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish(0, &message));
    }

    /* Test rx */
    {
        expect_msg(opcode_handlers[0].opcode, 0, access_params, sizeof(access_params));

        /* Send on element address handle. */
        access_reliable_message_rx_cb_Expect(model_handle, NULL, 0);
        access_reliable_message_rx_cb_IgnoreArg_p_message();
        access_reliable_message_rx_cb_IgnoreArg_p_args();

        nrf_mesh_rx_metadata_t metadata;
        memset(&metadata, 0, sizeof(metadata));

        nrf_mesh_evt_t mesh_evt;
        memset(&mesh_evt, 0, sizeof(mesh_evt));
        mesh_evt.params.message.p_metadata = &metadata;
        mesh_evt.type = NRF_MESH_EVT_MESSAGE_RECEIVED;
        mesh_evt.params.message.p_buffer = access_payload;
        mesh_evt.params.message.length = sizeof(access_payload);
        mesh_evt.params.message.src.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
        mesh_evt.params.message.src.value= SOURCE_ADDRESS;
        mesh_evt.params.message.secmat.p_net = NULL;
        mesh_evt.params.message.secmat.p_app = NULL;
        mesh_evt.params.message.dst.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
        mesh_evt.params.message.dst.value = ELEMENT_ADDRESS_START;

        nrf_mesh_is_address_rx_ExpectAndReturn(&mesh_evt.params.message.dst, true);
        dsm_local_unicast_addresses_get_Expect(NULL);
        dsm_local_unicast_addresses_get_IgnoreArg_p_address();
        dsm_local_unicast_addresses_get_ReturnThruPtr_p_address(&local_addresses);
        dsm_appkey_handle_get_ExpectAndReturn(NULL, 0);
        dsm_subnet_handle_get_ExpectAndReturn(NULL, 0);

        mp_evt_handler->evt_cb(&mesh_evt);
    }
}

void test_error_conditions(void)
{
    /* Not initialized */
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_address_set(0, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_period_set(0, (access_publish_resolution_t) 0, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_subscription_add(0, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_subscription_remove(0, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_application_bind(0, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_application_unbind(0, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_application_set(0, 0));

    build_device_setup(ACCESS_ELEMENT_COUNT, ACCESS_MODEL_COUNT);

    /* Out of bounds */
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_address_set(ACCESS_MODEL_COUNT, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_period_set(ACCESS_MODEL_COUNT, (access_publish_resolution_t) 0, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_subscription_add(ACCESS_MODEL_COUNT, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_subscription_remove(ACCESS_MODEL_COUNT, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_application_bind(ACCESS_MODEL_COUNT, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_application_unbind(ACCESS_MODEL_COUNT, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_application_set(ACCESS_MODEL_COUNT, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_element_location_set(ACCESS_ELEMENT_COUNT, 0));

    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, access_model_publish_address_set(0, DSM_ADDR_MAX));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, access_model_subscription_add(0, DSM_ADDR_MAX));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, access_model_subscription_remove(0, DSM_ADDR_MAX));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, access_model_application_bind(0, DSM_APP_MAX + DSM_DEVICE_MAX));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, access_model_application_unbind(0, DSM_APP_MAX + DSM_DEVICE_MAX));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, access_model_publish_application_set(0, DSM_APP_MAX + DSM_DEVICE_MAX));

