NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_access.c
    uint16_t location;
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_element_location_get(0, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_element_location_get(ACCESS_ELEMENT_COUNT, &location));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_location_set(0, 0x0103)); /* "Bottom", false */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_location_get(0, &location));
    TEST_ASSERT_EQUAL(0x0103, location);

    void * p_args;
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_p_args_get(0, &p_args));

    /* Allocate a model */
    access_model_add_params_t init_params;
    init_params.element_index = 0;
    init_params.model_id.model_id = TEST_MODEL_ID;
    init_params.model_id.company_id = ACCESS_COMPANY_ID_NONE;
    init_params.p_opcode_handlers = &m_opcode_handlers[0][0];
    init_params.opcode_count = OPCODE_COUNT;
    init_params.p_args = TEST_REFERENCE;
    init_params.publish_timeout_cb = publish_timeout_cb;

    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_add(&init_params, &handle));
    TEST_ASSERT_EQUAL(0, handle);

    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_sig_model_count_get(0, &model_count));
    TEST_ASSERT_EQUAL(1, model_count);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_vendor_model_count_get(0, &model_count));
    TEST_ASSERT_EQUAL(0, model_count);

    init_params.publish_timeout_cb = NULL;
    init_params.model_id.company_id = 0x1337;
    init_params.element_index = 1;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_add(&init_params, &handle));
    TEST_ASSERT_EQUAL(1, handle);

    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_sig_model_count_get(1, &model_count));
    TEST_ASSERT_EQUAL(0, model_count);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_vendor_model_count_get(1, &model_count));
    TEST_ASSERT_EQUAL(1, model_count);

    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_SUPPORTED, access_model_subscription_add(0, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_SUPPORTED, access_model_subscription_remove(0, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_STATE, access_model_subscription_lists_share(0, 1));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_alloc(0));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_alloc(0));

    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_lists_share(0, 1));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_lists_share(0, 1));

    model_id.model_id = TEST_MODEL_ID;
    model_id.company_id = ACCESS_COMPANY_ID_NONE;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_handle_get(0, model_id, &handle));
    TEST_ASSERT_EQUAL(0, handle);

    address_handle = 2;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_address_set(0, address_handle));
    address_handle = 0;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_address_get(0, &address_handle));
    TEST_ASSERT_EQUAL(2, address_handle);

    resolution = (access_publish_resolution_t) 1;
    step_number = 2;
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_SUPPORTED, access_model_publish_period_set(1, resolution, step_number));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_SUPPORTED, access_model_publish_period_get(1, &resolution, &step_number));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, access_model_publish_period_set(0, (access_publish_resolution_t) (ACCESS_PUBLISH_RESOLUTION_MAX + 1), step_number));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, access_model_publish_period_set(0, (access_publish_resolution_t) 0, ACCESS_PUBLISH_PERIOD_STEP_MAX + 1));

    access_publish_period_set_Expect(NULL, resolution, step_number);
    access_publish_period_set_IgnoreArg_p_pubstate();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_period_set(0, resolution, step_number));

    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_period_get(0, &resolution, &step_number));

    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_add(0, 3));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_add(0, 2));
    size = 0;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_LENGTH, access_model_subscriptions_get(0, addresses, &size));
    size = 1;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_LENGTH, access_model_subscriptions_get(0, addresses, &size));
    for (uint32_t i = 0; i < 2; ++i)
    {
        /* Test for both models that share the same list :) */
        size = DSM_ADDR_MAX;
        addresses[0] = 0;
        addresses[1] = 0;
        TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscriptions_get(i, addresses, &size));
        TEST_ASSERT_EQUAL(2, size);
        TEST_ASSERT_EQUAL(2, addresses[0]);
    }

    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_remove(0, 2));
    for (uint32_t i = 0; i < 2; ++i)
    {
        /* Should be removed for both. */
        size = DSM_ADDR_MAX;
        addresses[0] = 0;
        TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscriptions_get(0, addresses, &size));
        TEST_ASSERT_EQUAL(1, size);
        TEST_ASSERT_EQUAL(3, addresses[0]);
    }

    applications[0] = 4;
    applications[1] = 3;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_application_bind(0, applications[0]));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_application_bind(0, applications[1]));
    size = 0;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_LENGTH, access_model_applications_get(0, applications, &size));
    size = 1;
    applications[0] = 0;
    applications[1] = 0;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_LENGTH, access_model_applications_get(0, applications, &size));
    size = 2;
    applications[0] = 0;
    applications[1] = 0;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_applications_get(0, applications, &size));
    TEST_ASSERT_EQUAL(3, applications[0]);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_application_unbind(0, applications[0]));
    size = DSM_APP_MAX + DSM_DEVICE_MAX;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_applications_get(0, applications, &size));
    TEST_ASSERT_EQUAL(1, size);

    appkey_handle = 4;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_application_set(0, appkey_handle));
    appkey_handle = 0;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_application_get(0, &appkey_handle));
    TEST_ASSERT_EQUAL(4, appkey_handle);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_id_get(0, &model_id));
    TEST_ASSERT_EQUAL(TEST_MODEL_ID, model_id.model_id);
    TEST_ASSERT_EQUAL(ACCESS_COMPANY_ID_NONE, model_id.company_id);

    p_args = NULL;
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_model_p_args_get(0, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_p_args_get(ACCESS_MODEL_COUNT, &p_args));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_p_args_get(0, &p_args));
    TEST_ASSERT_EQUAL_PTR(TEST_REFERENCE, p_args);

