NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_access.c
    ttl = NRF_MESH_TTL_MAX + 1;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, access_model_publish_ttl_set(0, ttl));
    ttl = NRF_MESH_TTL_MAX;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_ttl_set(0, ttl));
    ttl = 0;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_ttl_get(0, &ttl));
    TEST_ASSERT_EQUAL(NRF_MESH_TTL_MAX, ttl);

    flag = 1;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_friendship_credential_flag_set(0, flag));
    flag = 0;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_friendship_credential_flag_get(0, &flag));
    TEST_ASSERT_EQUAL(1, flag);
}

static void update_reloaded_publish_params(access_flash_test_struct_t * p_test_vector)
{
    if (ACCESS_MODEL_PUBLISH_PERIOD_RESTORE == 0)
    {
        p_test_vector->publish_period.step_res = 0;
        p_test_vector->publish_period.step_num = 0;
    }
}

static void expect_load_from_empty_flash(void)
{
    /* If there is nothing stored, and the flash_manager returns not found for metadata we expect nothing to happen: */
    uint32_t entry_length = sizeof(access_flash_metadata_t);
    flash_manager_entry_read_ExpectAndReturn(mp_flash_manager, FLASH_HANDLE_METADATA, NULL, &entry_length, NRF_ERROR_NOT_FOUND);
    flash_manager_entry_read_IgnoreArg_p_data();
}

void test_flash_load_reload(void)
{
    uint8_t number_of_models = 0;
    uint8_t number_of_sublists = 0;
    /* Build some models, verify their content, store in "flash", wipe access layer state,
     * add the same models again and restore and check the expected state.*/

    /************************************ Build test vectors *************************************/
    dsm_handle_t appkeys[] = {0x0,0x1,0x2,0x3,0x4,0x5};
    dsm_handle_t addresses[] = {0x6,0x7,0x8,0x9,0xA};
    uint32_t sizeof_addresses = sizeof(addresses)/sizeof(dsm_handle_t);
    uint32_t sizeof_appkeys = sizeof(appkeys)/sizeof(dsm_handle_t);
    uint32_t address_bitfield[BITFIELD_BLOCK_COUNT(DSM_ADDR_MAX)];
    bitfield_set_all(address_bitfield, DSM_ADDR_MAX);
    TEST_ASSERT_EQUAL(address_bitfield[0], UINT32_MAX);
    for (uint32_t i = 0; i < sizeof_addresses; ++i)
    {
        bitfield_clear(address_bitfield, addresses[i]);
    }
    access_model_id_t model_id1 = {0x1337, 0x15};
    access_model_id_t model_id2 = {0xC000, 0x0001};
    access_publish_period_t pub_period1 = {1,5};
    access_publish_period_t pub_period2 = {(1<<ACCESS_PUBLISH_STEP_RES_BITS) - 1, (1<<ACCESS_PUBLISH_STEP_NUM_BITS) - 1};

    /*lint -save -e651 -e64 Disregard warnings about confusing initializers and type mismatches caused by the macros. */
    access_flash_test_struct_t test_vector[] =
    {
        FLASH_TEST_VECTOR_INSTANCE(model_id1, 0, &addresses[0], 2, UINT32_MAX, 0xA, pub_period1, &appkeys[0], 3, 0x1, 4, 0),
        FLASH_TEST_VECTOR_INSTANCE(model_id2, 1, &addresses[2], sizeof_addresses -2, 0, 0xC, pub_period2, &appkeys[3], sizeof_appkeys - 3, 0x0, 127, 1)
    };
    uint32_t test_vector_size = sizeof(test_vector)/sizeof(access_flash_test_struct_t);
    /*lint -restore */

   /****************** Add models and configure as specified by the test vector. ******************/
    access_model_handle_t model_handle[test_vector_size];
    for (uint32_t i = 0; i < test_vector_size; ++i)
    {
        model_handle[i] = init_test_model_and_subs_list(&test_vector[i]);
        number_of_models++;
        update_test_model(&test_vector[i], model_handle[i], true);
    }

    /***************** Store the necessary configuration for a restore on bootup. *****************/

    /** Expect the metadata to be written since this is the first store call */
    fm_entry_t * p_metadata_flash_entry = expect_flash_manager_entry(FLASH_HANDLE_METADATA, sizeof(access_flash_metadata_t));
    /** Expect only one of the subscription lists to be written since it's shared by both of the models in the test vector. */
    fm_entry_t * p_subs_flash_entry[ACCESS_SUBSCRIPTION_LIST_COUNT];
    p_subs_flash_entry[number_of_sublists] = expect_flash_manager_entry(FLASH_GROUP_SUBS_LIST, sizeof(access_flash_subscription_list_t));
    number_of_sublists++;
    /** We made no changes to the "location" of the elements so no flash operations expected. */
    /** All the models added by the test vector should be stored to flash. */
    fm_entry_t * p_model_flash_entry[test_vector_size + 1];
    for (uint32_t i = 0; i < test_vector_size; ++i)
    {
        p_model_flash_entry[i] = expect_flash_manager_entry(FLASH_GROUP_MODEL | model_handle[i], sizeof(access_model_state_data_t));
    }
    /* All stored successfully. First execute load, to enable storage. */
    expect_load_from_empty_flash();
    TEST_ASSERT_TRUE(access_flash_config_load());
    bearer_event_critical_section_begin_Expect();
    bearer_event_critical_section_end_Expect();
    access_flash_config_store();

    /********************* Verify the data sent to the flash_manager: *****************************/
    access_flash_metadata_t * p_metadata = (access_flash_metadata_t *)p_metadata_flash_entry->data;
    TEST_ASSERT_EQUAL_UINT16(ACCESS_ELEMENT_COUNT, p_metadata->element_count);
    TEST_ASSERT_EQUAL_UINT16(ACCESS_SUBSCRIPTION_LIST_COUNT, p_metadata->subscription_list_count);
    TEST_ASSERT_EQUAL_UINT16(ACCESS_MODEL_COUNT, p_metadata->model_count);
    access_flash_subscription_list_t * p_subs_list = (access_flash_subscription_list_t *) p_subs_flash_entry[0]->data;
    TEST_ASSERT_EQUAL(FLASH_GROUP_SUBS_LIST | 0, p_subs_flash_entry[0]->header.handle);
    TEST_ASSERT_EQUAL_UINT32_ARRAY(address_bitfield, p_subs_list->inverted_bitfield, BITFIELD_BLOCK_COUNT(DSM_ADDR_MAX));

    for (uint32_t i = 0; i < test_vector_size; ++i)
    {
        TEST_ASSERT_EQUAL(FLASH_GROUP_MODEL | i, p_model_flash_entry[i]->header.handle);
        access_model_state_data_t * p_model_data = (access_model_state_data_t *) p_model_flash_entry[i]->data;
        verify_flash_modeldata(&test_vector[i], p_model_data, 0);
    }

    /****************** Try store without and with further changes to the models ******************/

