NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_access.c
    /* Since nothing has changed in access configuration another store should not call the flash api. */
    bearer_event_critical_section_begin_Expect();
    bearer_event_critical_section_end_Expect();
    access_flash_config_store();

    /* Change location of one element and call store. */
    uint16_t location_element2 = 5;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_location_set(1, location_element2));
    fm_entry_t * p_element_flash_entry = expect_flash_manager_entry(FLASH_GROUP_ELEMENT | 1, sizeof(uint16_t));
    bearer_event_critical_section_begin_Expect();
    bearer_event_critical_section_end_Expect();
    access_flash_config_store();
    uint16_t * p_location = (uint16_t *)&p_element_flash_entry->data[0];
    TEST_ASSERT_EQUAL_UINT16(location_element2, *p_location);

    /* Since nothing has changed in access configuration another store should not call the flash api. */
    bearer_event_critical_section_begin_Expect();
    bearer_event_critical_section_end_Expect();
    access_flash_config_store();

    /* Changing element location to 0 will do nothing since that's the default value*/
    uint16_t location_element1 = 0;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_location_set(0, location_element1));
    bearer_event_critical_section_begin_Expect();
    bearer_event_critical_section_end_Expect();
    access_flash_config_store();

    /* Updating model info (subscribe/puiblish information) without actually changing any value should not cause flash operations */
    for (uint32_t i = 0; i < test_vector_size; ++i)
    {
        update_test_model(&test_vector[i], model_handle[i], false);
    }
    bearer_event_critical_section_begin_Expect();
    bearer_event_critical_section_end_Expect();
    access_flash_config_store();

    /*  Using a new ttl value for the first model will initiate a flash operation for the whole model, but not other models */
    test_vector[0].publish_ttl = 50;
    update_test_model(&test_vector[0], model_handle[0], false);
    p_model_flash_entry[0] = expect_flash_manager_entry(FLASH_GROUP_MODEL | model_handle[0], sizeof(access_model_state_data_t));
    for (uint32_t i = 1; i < test_vector_size; ++i)
    {
        update_test_model(&test_vector[i], model_handle[i], false);
    }

    bearer_event_critical_section_begin_Expect();
    bearer_event_critical_section_end_Expect();
    access_flash_config_store();

    for (uint32_t i = 0; i < test_vector_size; ++i)
    {
        access_model_state_data_t * p_model_data = (access_model_state_data_t *) p_model_flash_entry[i]->data;
        verify_flash_modeldata(&test_vector[i], p_model_data, 0);
    }

    /********************************* Reset access and lose all data:*****************************/
    access_publish_init_Expect();
    access_reliable_init_Expect();
    access_publish_retransmission_init_Expect();
    access_init();
    /* Check that elements are un populated */
    access_model_handle_t model_handles[ACCESS_MODEL_COUNT];
    uint16_t models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_models_get(0, model_handles, &models_count));
    TEST_ASSERT_EQUAL(0, models_count);
    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_models_get(1, model_handles, &models_count));
    TEST_ASSERT_EQUAL(0, models_count);

    /* If there is nothing stored, and the flash_manager returns not found for metadata we expect nothing to happen: */
    uint32_t entry_length = sizeof(access_flash_metadata_t);
    expect_load_from_empty_flash();
    TEST_ASSERT_TRUE(access_flash_config_load());

    /********************************* Restore access state from flash:*****************************/
    /* First read the metadata*/
    flash_manager_entry_read_ExpectAndReturn(mp_flash_manager, FLASH_HANDLE_METADATA, NULL, &entry_length, NRF_SUCCESS);
    flash_manager_entry_read_IgnoreArg_p_data();
    flash_manager_entry_read_ReturnMemThruPtr_p_data(p_metadata_flash_entry->data, sizeof(access_flash_metadata_t));
    /* Metadata is sane so subscriptionlist, elements, and models should be restored */
    fm_handle_filter_t subs_filter = {.mask = FLASH_HANDLE_FILTER_MASK, .match = FLASH_GROUP_SUBS_LIST};
    restore_flash(&subs_filter, p_subs_flash_entry, number_of_sublists);

    fm_handle_filter_t elem_filter = {.mask = FLASH_HANDLE_FILTER_MASK, .match = FLASH_GROUP_ELEMENT};
    restore_flash(&elem_filter, &p_element_flash_entry, 1);
    fm_handle_filter_t model_filter = {.mask = FLASH_HANDLE_FILTER_MASK, .match = FLASH_GROUP_MODEL};
    restore_flash(&model_filter, p_model_flash_entry, number_of_models);
    for (int i = sizeof_addresses-1; i >= 0; --i)
    {
        dsm_address_publish_add_handle_IgnoreAndReturn(NRF_SUCCESS);
        dsm_address_subscription_add_handle_IgnoreAndReturn(NRF_SUCCESS);
    }

    for (uint32_t i = 0; i < number_of_models; i++)
    {
        if (ACCESS_MODEL_PUBLISH_PERIOD_RESTORE)
        {
            access_publish_period_set_Expect(NULL,
                                            ((access_model_state_data_t *) p_model_flash_entry[i]->data)->publication_period.step_res,
                                            ((access_model_state_data_t *) p_model_flash_entry[i]->data)->publication_period.step_num);
            access_publish_period_set_IgnoreArg_p_pubstate();
        }
    }

    TEST_ASSERT_TRUE(access_flash_config_load());

    /* Adding models before a restore is also accepted. */
    access_publish_init_Expect();
    access_reliable_init_Expect();
    access_publish_retransmission_init_Expect();
    access_init();
    /* Add models first before restore*/
    access_model_handle_t reinit_handle;
    for (uint32_t i = 0; i < test_vector_size; ++i)
    {
       TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_add(&test_vector[i].add_params, &reinit_handle));
    }

    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_models_get(0, model_handles, &models_count));
    TEST_ASSERT_EQUAL(1, models_count);
    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_vendor_model_count_get(0, (uint8_t *)&models_count));
    TEST_ASSERT_EQUAL(1, models_count);
    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_models_get(1, model_handles, &models_count));
    TEST_ASSERT_EQUAL(1, models_count);
    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_vendor_model_count_get(1, (uint8_t *)&models_count));
    TEST_ASSERT_EQUAL(1, models_count);

    /* First read the metadata */
    flash_manager_entry_read_ExpectAndReturn(mp_flash_manager, FLASH_HANDLE_METADATA, NULL, &entry_length, NRF_SUCCESS);
    flash_manager_entry_read_IgnoreArg_p_data();
    flash_manager_entry_read_ReturnMemThruPtr_p_data(p_metadata_flash_entry->data, sizeof(access_flash_metadata_t));
    restore_flash(&subs_filter, p_subs_flash_entry, number_of_sublists);
    restore_flash(&elem_filter, &p_element_flash_entry, 1);
    restore_flash(&model_filter, p_model_flash_entry, number_of_models);

