NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_access.c
    for (uint32_t i = 0; i < number_of_models; i++)
    {
        if (ACCESS_MODEL_PUBLISH_PERIOD_RESTORE)
        {
            access_publish_period_set_Expect(NULL,
                                            ((access_model_state_data_t *) p_model_flash_entry[i]->data)->publication_period.step_res,
                                            ((access_model_state_data_t *) p_model_flash_entry[i]->data)->publication_period.step_num);
            access_publish_period_set_IgnoreArg_p_pubstate();
        }
    }
    TEST_ASSERT_TRUE(access_flash_config_load());

    /* Verify that reading from access will produce the values given by the test vectors. */
    for (uint32_t i = 0; i < test_vector_size; ++i)
    {
        access_flash_test_struct_t new_test_vector = test_vector[i];
        update_reloaded_publish_params(&new_test_vector);
        verify_test_case_and_access_state(&new_test_vector, model_handle[i]);
    }

    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_models_get(0, model_handles, &models_count));
    TEST_ASSERT_EQUAL(1, models_count);
    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_vendor_model_count_get(0, (uint8_t *)&models_count));
    TEST_ASSERT_EQUAL(1, models_count);
    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_models_get(1, model_handles, &models_count));
    TEST_ASSERT_EQUAL(1, models_count);
    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_vendor_model_count_get(1, (uint8_t *)&models_count));
    TEST_ASSERT_EQUAL(1, models_count);

    uint16_t location = 0xFF;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_location_get(0, &location));
    TEST_ASSERT_EQUAL(location_element1, location);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_location_get(1, &location));
    TEST_ASSERT_EQUAL(location_element2, location);


    /**************************************** Flash erase *****************************************/
    /* Try a direct call to access_clear */
    flash_manager_remove_ExpectAndReturn(mp_flash_manager, NRF_SUCCESS);
    access_reliable_cancel_all_Expect();
    access_clear();

    /* Return unexpected metadata from flash, this should trigger wipe, and an error message. */
    p_metadata = (access_flash_metadata_t *) p_metadata_flash_entry->data;
    p_metadata->model_count--;
    flash_manager_entry_read_ExpectAndReturn(mp_flash_manager, FLASH_HANDLE_METADATA, NULL, &entry_length, NRF_SUCCESS);
    flash_manager_entry_read_IgnoreArg_p_data();
    flash_manager_entry_read_ReturnMemThruPtr_p_data(p_metadata_flash_entry->data, sizeof(access_flash_metadata_t));
    flash_manager_remove_ExpectAndReturn(mp_flash_manager, NRF_SUCCESS);
    dsm_clear_ExpectAnyArgs();
    TEST_ASSERT_FALSE(access_flash_config_load());

    /************************************** Flash callbacks ***************************************/
    /* A call back about the removal of the flash manager should cause it to be added again. */
    uint32_t expected_add_calls = m_flash_manager_calls + 1;
    /** Expect the metadata to be written since we have erased the flash in earlier tests. (fail this attempt) */
    m_flash_manager_config.remove_complete_cb(mp_flash_manager);
    TEST_ASSERT_EQUAL(expected_add_calls, m_flash_manager_calls);

    /* Test the write complete callback all are ignored except flash malfunction */
    m_flash_manager_config.write_complete_cb(mp_flash_manager, p_metadata_flash_entry, FM_RESULT_SUCCESS);
    nrf_mesh_evt_t evt =
        {
            .type = NRF_MESH_EVT_FLASH_FAILED,
            .params.flash_failed.user = NRF_MESH_FLASH_USER_ACCESS,
            .params.flash_failed.p_flash_entry = p_metadata_flash_entry,
            .params.flash_failed.p_flash_page = NULL,
            .params.flash_failed.p_area = mp_flash_manager->config.p_area,
            .params.flash_failed.page_count = mp_flash_manager->config.page_count,
        };
    event_handle_Expect(&evt);
    m_flash_manager_config.write_complete_cb(mp_flash_manager, p_metadata_flash_entry, FM_RESULT_ERROR_FLASH_MALFUNCTION);
    TEST_NRF_MESH_ASSERT_EXPECT(m_flash_manager_config.write_complete_cb(mp_flash_manager, p_metadata_flash_entry, FM_RESULT_ERROR_AREA_FULL));
    TEST_NRF_MESH_ASSERT_EXPECT(m_flash_manager_config.write_complete_cb(mp_flash_manager, p_metadata_flash_entry, FM_RESULT_ERROR_NOT_FOUND));

    /****************************** Retry failed flash operations  ********************************/
    /* First execute load, to enable storage. */
    expect_load_from_empty_flash();
    TEST_ASSERT_TRUE(access_flash_config_load());

    /* Try a store but fail to write the metadata */
    TEST_ASSERT_EQUAL(0, m_listener_register_calls);
    flash_manager_entry_alloc_ExpectAndReturn(mp_flash_manager, FLASH_HANDLE_METADATA, sizeof(access_flash_metadata_t), NULL);
    bearer_event_critical_section_begin_Expect();
    bearer_event_critical_section_end_Expect();
    access_flash_config_store();
    /* The failed attempt will trigger a register call. */
    TEST_ASSERT_EQUAL(1, m_listener_register_calls);
    /* test access_clear */
    flash_manager_remove_ExpectAndReturn(mp_flash_manager, NRF_ERROR_NO_MEM);
    access_reliable_cancel_all_Expect();
    access_clear();
    TEST_ASSERT_EQUAL(2, m_listener_register_calls);

    /* A call-back will trigger config_clear again*/
    flash_manager_remove_ExpectAndReturn(mp_flash_manager, NRF_ERROR_NO_MEM);
    mp_mem_listener->callback(mp_mem_listener->p_args);
    TEST_ASSERT_EQUAL(3, m_listener_register_calls);

    flash_manager_remove_ExpectAndReturn(mp_flash_manager, NRF_SUCCESS);
    mp_mem_listener->callback(mp_mem_listener->p_args);
    TEST_ASSERT_EQUAL(3, m_listener_register_calls);

    /* test config store */
    /* First execute load, to enable storage. */
    expect_load_from_empty_flash();
    TEST_ASSERT_TRUE(access_flash_config_load())
    bearer_event_critical_section_begin_Expect();
    bearer_event_critical_section_end_Expect();
    access_flash_config_store();
    TEST_ASSERT_EQUAL(4, m_listener_register_calls);
    /** Send an erase complete event, we should be able to make config store calls then. */
    m_flash_manager_config.remove_complete_cb(mp_flash_manager);

    flash_manager_entry_alloc_ExpectAndReturn(mp_flash_manager, FLASH_HANDLE_METADATA, sizeof(access_flash_metadata_t), NULL);
    bearer_event_critical_section_begin_Expect();
    bearer_event_critical_section_end_Expect();
    mp_mem_listener->callback(mp_mem_listener->p_args);
    TEST_ASSERT_EQUAL(5, m_listener_register_calls);

    /* A call-back will trigger config_store */
    /* Only metadata will be stored since everything else has been cleared*/
    (void) expect_flash_manager_entry(FLASH_HANDLE_METADATA, sizeof(access_flash_metadata_t));
    bearer_event_critical_section_begin_Expect();
    bearer_event_critical_section_end_Expect();
    mp_mem_listener->callback(mp_mem_listener->p_args);

    /* Since we stored everything the callback should do nothing: */
    bearer_event_critical_section_begin_Expect();
    bearer_event_critical_section_end_Expect();
    mp_mem_listener->callback(mp_mem_listener->p_args);
}

void test_subscription_dealloc_and_dealloc_share_combination(void)
{
    uint16_t i;

    /* Ensure access layer is stable */
    m_flash_manager_config.write_complete_cb(mp_flash_manager, NULL, FM_RESULT_SUCCESS);
    printf("ACCESS_SUBSCRIPTION_LIST_COUNT: %d\n",ACCESS_SUBSCRIPTION_LIST_COUNT);

    /* Allocate a model */
    access_model_add_params_t init_params;
    access_model_handle_t handle;
    uint8_t model_count;
    uint16_t dealloc_index;

    for (i = 0; i < ACCESS_MODEL_COUNT; i++)
    {
        init_params.element_index = 0;
        init_params.model_id.model_id = TEST_MODEL_ID + i;
        init_params.model_id.company_id = ACCESS_COMPANY_ID_NONE;
        init_params.p_opcode_handlers = &m_opcode_handlers[0][0];
        init_params.opcode_count = OPCODE_COUNT;
        init_params.p_args = TEST_REFERENCE;
        init_params.publish_timeout_cb = publish_timeout_cb;

        TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_add(&init_params, &handle));
        TEST_ASSERT_EQUAL(i, handle);

