NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_access.c
        TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_sig_model_count_get(0, &model_count));
        TEST_ASSERT_EQUAL(i + 1, model_count);

        /* Allocate subscription list for all, except first three, for testing purpose */
        if (i > 2)
        {
            TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_alloc(handle));
        }
    }

    init_params.model_id.model_id = TEST_MODEL_ID + i;
    TEST_ASSERT_EQUAL(NRF_ERROR_NO_MEM, access_model_add(&init_params, &handle));

    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_SUPPORTED, access_model_subscription_add(0, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_SUPPORTED, access_model_subscription_remove(0, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_SUPPORTED, access_model_subscription_add(1, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_SUPPORTED, access_model_subscription_remove(1, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_STATE, access_model_subscription_lists_share(0, 1));

    /* Allocate subscription list for 0, and 1 */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_alloc(0));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_alloc(1));
    TEST_ASSERT_EQUAL(NRF_ERROR_NO_MEM, access_model_subscription_list_alloc(2));

    flash_manager_entry_count_get_IgnoreAndReturn(0);
    /* Test: Share subscription list: owner:0, other:1, and then allocate for third one */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_lists_share(0, 1));
    dealloc_index = m_sub_list_dealloc_index;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_alloc(2));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_alloc(2));

    /* Test: De-alloc subscription list of `2` multiple times and try reallocating it. */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_dealloc(2));
    TEST_ASSERT_EQUAL(dealloc_index, m_sub_list_dealloc_index);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_alloc(2));

    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_dealloc(2));
    TEST_ASSERT_EQUAL(dealloc_index, m_sub_list_dealloc_index);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_dealloc(2));
    TEST_ASSERT_EQUAL(dealloc_index, m_sub_list_dealloc_index);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_alloc(2));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_alloc(2));

    /* Test: De-alloc subscription list for owner:0, and try sharing */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_dealloc(0));
    dealloc_index = m_sub_list_dealloc_index;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_STATE, access_model_subscription_lists_share(0, 1));

    /* Test: Try Alloc subscription list for other:1 */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_alloc(1));

    /* Test: Try de-alloc for other:1, alloc subscription list for owner:0, and try sharing */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_dealloc(1));
    TEST_ASSERT_TRUE(dealloc_index == m_sub_list_dealloc_index);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_alloc(0));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_lists_share(0, 1));

    /* Test: De-alloc subscription list for owner:0 and other:1 and try sharing */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_dealloc(0));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_dealloc(1));
    TEST_ASSERT_TRUE(dealloc_index == m_sub_list_dealloc_index);
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_STATE, access_model_subscription_lists_share(0, 1));


    /* Test: De-alloc fails, if the access configuration is frozen */
    /* First execute load, to enable storage. */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_alloc(0));
    /* Freeze config */
    expect_load_from_empty_flash();
    TEST_ASSERT_TRUE(access_flash_config_load());

    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_dealloc(1));
    TEST_ASSERT_EQUAL(NRF_ERROR_FORBIDDEN, access_model_subscription_list_dealloc(0));

    /* Test: Share fails, if the access configuration is frozen */
    TEST_ASSERT_EQUAL(NRF_ERROR_FORBIDDEN, access_model_subscription_lists_share(0, 1));

}

void test_access_model_publish_period_divisor_set(void)
{
    /* Allocate a model - 0 : With publish support */
    access_model_handle_t handle0;
    access_model_add_params_t init_params;
    init_params.element_index = 0;
    init_params.model_id.model_id = TEST_MODEL_ID;
    init_params.model_id.company_id = ACCESS_COMPANY_ID_NONE;
    init_params.p_opcode_handlers = &m_opcode_handlers[0][0];
    init_params.opcode_count = OPCODE_COUNT;
    init_params.p_args = TEST_REFERENCE;
    init_params.publish_timeout_cb = publish_timeout_cb;

    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_add(&init_params, &handle0));
    TEST_ASSERT_EQUAL(0, handle0);

    /* Allocate a model - 1 : Without publish support */
    access_model_handle_t handle1;
    init_params.element_index = 1;
    init_params.model_id.model_id = TEST_MODEL_ID;
    init_params.model_id.company_id = ACCESS_COMPANY_ID_NONE;
    init_params.p_opcode_handlers = &m_opcode_handlers[0][0];
    init_params.opcode_count = OPCODE_COUNT;
    init_params.p_args = TEST_REFERENCE;
    init_params.publish_timeout_cb = NULL;

    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_add(&init_params, &handle1));
    TEST_ASSERT_EQUAL(1, handle1);

    access_publish_resolution_t resolution = ACCESS_PUBLISH_RESOLUTION_100MS;
    uint8_t step_number = 2;
    access_publish_period_set_Expect(NULL, resolution, step_number);
    access_publish_period_set_IgnoreArg_p_pubstate();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_period_set(handle0, resolution, step_number));

    /* Test invalid handle */
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_period_divisor_set(99, 1));

    /* Test invalid divisor value */
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, access_model_publish_period_divisor_set(handle0, 0));

    /* Test when model does not support publication */
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_SUPPORTED, access_model_publish_period_divisor_set(handle1, 1));

    /* Test divisor 1 results in same publish period settings */
    access_publish_period_set_Expect(NULL, resolution, step_number);
    access_publish_period_set_IgnoreArg_p_pubstate();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_period_divisor_set(handle0, 1));

    /* Test large divisor results in minimum publish interval */
    resolution = ACCESS_PUBLISH_RESOLUTION_100MS;
    step_number = 7;
    access_publish_period_set_Expect(NULL, resolution, step_number);
    access_publish_period_set_IgnoreArg_p_pubstate();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_period_set(handle0, resolution, step_number));

    access_publish_resolution_t exp_resolution = ACCESS_PUBLISH_RESOLUTION_100MS;
    uint8_t exp_step_number = 1;
    access_publish_period_set_Expect(NULL, exp_resolution, exp_step_number);
    access_publish_period_set_IgnoreArg_p_pubstate();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_period_divisor_set(handle0, 0xF000));

    /* Test for correctness of divisor. Period 60s, divisor 100 => result: 0.6 seconds */
    access_publish_period_set_Expect(NULL, resolution, step_number);
    access_publish_period_set_IgnoreArg_p_pubstate();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_period_divisor_set(handle0, 1));

    resolution = ACCESS_PUBLISH_RESOLUTION_10S;
    step_number = 6;

    access_publish_period_set_Expect(NULL, resolution, step_number);
    access_publish_period_set_IgnoreArg_p_pubstate();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_period_set(handle0, resolution, step_number));

    exp_resolution = ACCESS_PUBLISH_RESOLUTION_100MS;
    exp_step_number = 6;
    access_publish_period_set_Expect(NULL, exp_resolution, exp_step_number);
    access_publish_period_set_IgnoreArg_p_pubstate();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_period_divisor_set(handle0, 100));
}


